hx_sweep/He_1bar_Re2300_varprop/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (1.519227 0 0);
boundaryField
{
    inlet          { type flowRateInletVelocity; massFlowRate 7.314000e-04; rho rho; value uniform (1.519227 0 0); }
    outlet         { type pressureInletOutletVelocity; value uniform (1.519227 0 0); }
    heatedWall     { type noSlip; }
    adiabaticWalls { type noSlip; }
}
