hx_sweep/He_1bar_Re2300_varprop/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          T;
}

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 50;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 45;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 50;
        value           uniform 50;
    }
    heatedWall
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform 626.6667;   // 9.4 W over 0.015 m^2, delivered with the LOCAL kappa(T)
        kappaMethod     fluidThermo;
        value           uniform 45;
    }
    adiabaticWalls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
