hx_sweep/He_1bar_Re2300_varprop/system/sampleWallFace
FoamFile { version 2.0; format ascii; class dictionary; object sampleWallFace; }
type sets; libs (sampling); interpolationScheme cellPoint; setFormat raw; writeControl writeTime;
fields (T);
sets
(
    wallFace    { type uniform; axis x; start (0.0005 0.005 0.0);     end (0.2995 0.005 0.0);     nPoints 300; }
    wallFace2   { type uniform; axis x; start (0.0005 0.023 0.0);     end (0.2995 0.023 0.0);     nPoints 300; }
    profileZ    { type uniform; axis z; start (0.15 0.005 0.0);       end (0.15 0.005 0.01);      nPoints 200; }
);
